In [1]:
import pandas as pd

In [3]:
s = pd.Series([10000000, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    10000000
부산     3448737
인천     2890451
대구     2466052
dtype: int64

In [4]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
s.values

array([10000000,  3448737,  2890451,  2466052], dtype=int64)

In [7]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    10000000
부산     3448737
인천     2890451
대구     2466052
Name: 인구, dtype: int64

In [8]:
s / 1000000

도시
서울    10.000000
부산     3.448737
인천     2.890451
대구     2.466052
Name: 인구, dtype: float64

In [9]:
s[1], s["부산"]

(3448737, 3448737)

In [13]:
s[[0, 3, 1]]

도시
서울    10000000
대구     2466052
부산     3448737
Name: 인구, dtype: int64

In [14]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [15]:
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [16]:
s0.a

0

In [17]:
"서울" in s

True

In [18]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 10000000
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [21]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [20]:
data = {
    "15": [9904312, 3448737, 2890451, 2466052],
    "10": [9631482, 3393191, 2632035, 2431774],
    "05": [9762546, 3512547, 2517680, 2456016],
    "00": [9853972, 3655437, 2466338, 2473990],
    "지": ["수도권", "경상권", "수도권", "경상권"],
    "증": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역 2015 2010 2005 2000 2010-2015 증가율
서울  NaN  NaN  NaN  NaN  NaN           NaN
부산  NaN  NaN  NaN  NaN  NaN           NaN
인천  NaN  NaN  NaN  NaN  NaN           NaN
대구  NaN  NaN  NaN  NaN  NaN           NaN

In [22]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [23]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [24]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [27]:
import numpy as np

s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [29]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.294171 -1.602731 -2.283534 -0.307013
2013-01-02  0.778788 -0.109717 -0.150047  0.754196
2013-01-03 -0.567194 -0.243334 -0.927141  0.939776
2013-01-04  1.023106  0.593203  0.809942 -0.550815
2013-01-05  0.208109  1.275042 -0.985876 -0.727739
2013-01-06 -1.404944 -0.765399  1.763842  0.744000

In [31]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [32]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [33]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [34]:
df2.boxplot

<bound method boxplot_frame of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [35]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.023106  0.593203  0.809942 -0.550815
2013-01-05  0.208109  1.275042 -0.985876 -0.727739
2013-01-06 -1.404944 -0.765399  1.763842  0.744000

In [36]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.055339 -0.142156 -0.295469  0.142068
std    0.901144  1.008187  1.436100  0.749891
min   -1.404944 -1.602731 -2.283534 -0.727739
25%   -0.373368 -0.634883 -0.971192 -0.489864
50%    0.251140 -0.176526 -0.538594  0.218494
75%    0.657634  0.417473  0.569945  0.751647
max    1.023106  1.275042  1.763842  0.939776

In [37]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.294171    0.778788   -0.567194    1.023106    0.208109   -1.404944
B   -1.602731   -0.109717   -0.243334    0.593203    1.275042   -0.765399
C   -2.283534   -0.150047   -0.927141    0.809942   -0.985876    1.763842
D   -0.307013    0.754196    0.939776   -0.550815   -0.727739    0.744000

In [38]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.307013 -2.283534 -1.602731  0.294171
2013-01-02  0.754196 -0.150047 -0.109717  0.778788
2013-01-03  0.939776 -0.927141 -0.243334 -0.567194
2013-01-04 -0.550815  0.809942  0.593203  1.023106
2013-01-05 -0.727739 -0.985876  1.275042  0.208109
2013-01-06  0.744000  1.763842 -0.765399 -1.404944

In [39]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.294171 -1.602731 -2.283534 -0.307013
2013-01-06 -1.404944 -0.765399  1.763842  0.744000
2013-01-03 -0.567194 -0.243334 -0.927141  0.939776
2013-01-02  0.778788 -0.109717 -0.150047  0.754196
2013-01-04  1.023106  0.593203  0.809942 -0.550815
2013-01-05  0.208109  1.275042 -0.985876 -0.727739

In [2]:
df_hdays = pd.read_excel('https://goo.gl/G1gzHh')
df_hdays

             일자 및 요일    요일구분
0   2017-01-27 (FRI)  금요일
1   2017-01-30 (MON)  월요일
2   2017-03-01 (WED)  수요일
3   2017-05-01 (MON)  월요일
4   2017-05-03 (WED)  수요일
5   2017-05-05 (FRI)  금요일
6   2017-05-09 (TUE)  화요일
7   2017-06-06 (TUE)  화요일
8   2017-08-15 (TUE)  화요일
9   2017-10-03 (TUE)  화요일
10  2017-10-04 (WED)  수요일
11  2017-10-05 (THU)  목요일
12  2017-10-06 (FRI)  금요일
13  2017-10-09 (MON)  월요일
14  2017-12-25 (MON)  월요일
15  2017-12-29 (FRI)  금요일

In [3]:
hdays = df_hdays['일자 및 요일'].str.extract('(\d{4}-\d{2}-\d{2})', expand=False)
hdays = pd.to_datetime(hdays)
hdays.name = '날짜'
hdays

0    2017-01-27
1    2017-01-30
2    2017-03-01
3    2017-05-01
4    2017-05-03
5    2017-05-05
6    2017-05-09
7    2017-06-06
8    2017-08-15
9    2017-10-03
10   2017-10-04
11   2017-10-05
12   2017-10-06
13   2017-10-09
14   2017-12-25
15   2017-12-29
Name: 날짜, dtype: datetime64[ns]

In [4]:
mdays = pd.date_range('2017-01-01', '2017-12-31')
mdays

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10',
               ...
               '2017-12-22', '2017-12-23', '2017-12-24', '2017-12-25',
               '2017-12-26', '2017-12-27', '2017-12-28', '2017-12-29',
               '2017-12-30', '2017-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [5]:
mdays = pd.date_range('2017-01-01', '2017-12-31', freq='B')
mdays

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04', '2017-01-05',
               '2017-01-06', '2017-01-09', '2017-01-10', '2017-01-11',
               '2017-01-12', '2017-01-13',
               ...
               '2017-12-18', '2017-12-19', '2017-12-20', '2017-12-21',
               '2017-12-22', '2017-12-25', '2017-12-26', '2017-12-27',
               '2017-12-28', '2017-12-29'],
              dtype='datetime64[ns]', length=260, freq='B')

In [6]:
mdays = mdays.drop(hdays)
mdays

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04', '2017-01-05',
               '2017-01-06', '2017-01-09', '2017-01-10', '2017-01-11',
               '2017-01-12', '2017-01-13',
               ...
               '2017-12-14', '2017-12-15', '2017-12-18', '2017-12-19',
               '2017-12-20', '2017-12-21', '2017-12-22', '2017-12-26',
               '2017-12-27', '2017-12-28'],
              dtype='datetime64[ns]', length=244, freq=None)